app/controllers/gossips_controller.rb

  def create
  	@gossip = Gossip.new(gossips_params)
  	if @gossip.save
---
INSERT INTO "gossips" ("anonymous_author", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["anonymous_author", "titre"], ["content", "article"], ["created_at", "2018-01-31 14:04:15.167298"], ["updated_at", "2018-01-31 14:04:15.167298"]]

	def update
		@gossip = Gossip.find(params[:id])
		if @gossip.update(params.require(:gossip).permit(:anonymous_author, :content))
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = ?, "updated_at" = ? WHERE "gossips"."id" = ?  [["content", "Ceci est le cgggg"], ["updated_at", "2018-01-31 17:28:34.234869"], ["id", 8]]